# IMDB: SQL Database
- Victoria White
- 27 October 2022

In [1]:
import json
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

## Data

In [2]:
#importing data
title_basics = 'https://datasets.imdbws.com/title.basics.tsv.gz'
title_akas = 'https://datasets.imdbws.com/title.akas.tsv.gz'
title_ratings = 'https://datasets.imdbws.com/title.ratings.tsv.gz'

## Saving Compressed Files

In [3]:
#creating folder for Data
import os
os.makedirs('Data/', exist_ok=True)
os.listdir("Data/")

['.ipynb_checkpoints',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json']

In [4]:
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [5]:
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory=False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [6]:
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory=False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1917
1  tt0000002            5.8       260
2  tt0000005            6.2      2541
3  tt0000006            5.1       175
4  tt0000007            5.4       796

In [7]:

df_basics = basics.copy()
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [8]:

df_akas = akas.copy()
df_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [9]:

df_ratings = ratings.copy()
df_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1917
1  tt0000002            5.8       260
2  tt0000005            6.2      2541
3  tt0000006            5.1       175
4  tt0000007            5.4       796

## Preprocessing

In [10]:
#replacing null values
df_basics.replace({'\\N':np.nan}, inplace=True)
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [11]:
#replacing null values
df_ratings.replace({'\\N':np.nan}, inplace=True)
df_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1917
1  tt0000002            5.8       260
2  tt0000005            6.2      2541
3  tt0000006            5.1       175
4  tt0000007            5.4       796

In [12]:
#replacing null values
df_akas.replace({'\\N':np.nan}, inplace=True)
df_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [13]:
#checking for duplicates
df_basics.duplicated().sum()

0

In [14]:
#checking for duplicates
df_akas.duplicated().sum()

0

In [15]:
#checking for duplicates
df_ratings.duplicated().sum()

0

In [16]:
#finding all missing values
df_basics.isna().sum()

tconst                 0
titleType              0
primaryTitle           0
originalTitle          0
isAdult                0
startYear              0
endYear           272504
runtimeMinutes         0
genres                 0
dtype: int64

In [17]:
#eliminating movies that are null in runtimeMinutes and genres
df_basics.dropna(subset='runtimeMinutes', inplace=True)
df_basics.dropna(subset='genres', inplace=True)
df_basics.isna().sum()

tconst                 0
titleType              0
primaryTitle           0
originalTitle          0
isAdult                0
startYear              0
endYear           272504
runtimeMinutes         0
genres                 0
dtype: int64

In [18]:
#changing dtype from object for startYear
df_basics.astype({'startYear':'int'}).dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear           int32
endYear           float64
runtimeMinutes      int64
genres             object
dtype: object

In [19]:
#filtering basics for movies outside of 2000-2021
drop_movies = df_basics[(df_basics['titleType'] != 'Movie') &
                        (df_basics['startYear'] <=1999) &
                        (df_basics['startYear'] >= 2022)].index
df_basics.drop(drop_movies, inplace=True)
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [20]:
#dropping short from titleType so only movie is included
short = df_basics[(df_basics['titleType'] == 'short')].index
df_basics.drop(short, inplace=True)
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [21]:
#dropping documentaries
is_documentary = df_basics['genres'].str.contains('documentary', case=False)
df_basics = df_basics[~is_documentary]
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [22]:
#filtering movies not in US region
not_US = df_akas[(df_akas['region'] != 'US')].index
df_akas.drop(not_US, inplace=True)
df_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [23]:
#filtering akas dataframe on the basics dataframe
keepers_basics = df_basics['tconst'].isin(df_akas['titleId'])
keepers_basics

0         True
1         True
2         True
3         True
4         True
          ...
282599    True
282600    True
282601    True
282602    True
282603    True
Name: tconst, Length: 282604, dtype: bool

In [24]:
#filtering basics
df_basics = df_basics[keepers_basics]
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [25]:
#filtering akas dataframe on ratings dataframe
keepers_ratings = df_ratings['tconst'].isin(df_akas['titleId'])
keepers_ratings

0         True
1         True
2         True
3         True
4         True
          ...
471730    True
471731    True
471732    True
471733    True
471734    True
Name: tconst, Length: 471735, dtype: bool

In [26]:
#filtering ratings
df_ratings = df_ratings[keepers_ratings]
df_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1917
1  tt0000002            5.8       260
2  tt0000005            6.2      2541
3  tt0000006            5.1       175
4  tt0000007            5.4       796

Checking info after filtering dataframes

In [27]:
df_basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 282604 entries, 0 to 282603
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          282604 non-null  object
 1   titleType       282604 non-null  object
 2   primaryTitle    282604 non-null  object
 3   originalTitle   282604 non-null  object
 4   isAdult         282604 non-null  int64
 5   startYear       282604 non-null  int64
 6   endYear         10100 non-null   float64
 7   runtimeMinutes  282604 non-null  int64
 8   genres          282604 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 21.6+ MB

In [28]:
df_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1359209 entries, 0 to 1359208
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1359209 non-null  object
 1   ordering         1359209 non-null  int64
 2   title            1359209 non-null  object
 3   region           1359209 non-null  object
 4   language         3689 non-null     object
 5   types            964586 non-null   object
 6   attributes       45157 non-null    object
 7   isOriginalTitle  1357834 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 83.0+ MB

In [29]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 471735 entries, 0 to 471734
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         471735 non-null  object
 1   averageRating  471735 non-null  float64
 2   numVotes       471735 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 14.4+ MB

## Transforming Data

In [30]:
df_basics['genres_split'] = df_basics['genres'].str.split(',')
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [31]:
exploded_genres = df_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
282600,tt9916204,tvEpisode,Better Angels,Better Angels,0,2019,NaN,42,"Drama,Thriller",Thriller
282601,tt9916254,video,Big Tit Cream Pie 32,Big Tit Cream Pie 32,1,2015,NaN,226,Adult,Adult
282602,tt9916348,video,Ancient World Exposed,Ancient World Exposed,0,2019,NaN,67,History,History
282603,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
282603,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [32]:
#finding unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [33]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [34]:
#making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_id_map = dict(zip(unique_genres, genre_ints))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [35]:
#make new integer genre_id and drop strin genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_id_map)
title_genres = title_genres.drop(columns=['genres_split'])
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [36]:
#creating dataframe with named cols from keys and values
genres = pd.DataFrame({'Genre_Name':genre_id_map.keys(),
                             'Genre_ID':genre_id_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## My SQL

In [37]:
with open('/Users/mrsvw/.secret/sql_credentials.json') as f:
          login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [38]:
#creating connection to database
connection_str  = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movie_sql"
engine = create_engine(connection_str)

In [39]:
#creating database
if database_exists(connection_str) == False: 
    create_database(connection_str)
else: 
    print('The database already exists.')

The database already exists.

In [40]:
title_basics = pd.read_csv('Data/title_basics.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [41]:
title_basics = title_basics.drop(columns=['originalTitle',
                                         'isAdult', 'titleType',
                                         'genres'])
title_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0096056,Crime and Punishment,2002,NaN,126

In [42]:
#creating title basics schema
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [43]:
title_basics.to_sql('title_basics', engine, dtype=basics_schema,
                    if_exists='replace',index=False)

282604

In [44]:
#adding primary key for title_basics
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [45]:
#creating ratings schema
key_len = df_ratings['tconst'].fillna('').map(len).max()

ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [46]:
df_ratings.to_sql('title_ratings', engine, dtype=ratings_schema,
                  if_exists='replace', index=False)

471735

In [47]:
#adding primary key for ratings table
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [48]:
#creating title_genres schema
key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [49]:
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema,
                    if_exists='replace', index=False)

521839

In [50]:
#creating genre schema
key_len = genres['Genre_Name'].fillna('').map(len).max()

genres_schema = {
    "Genre_Name": String(key_len+1), 
    'Genre_ID':Integer()}

In [51]:
genres.to_sql('genres', engine, dtype=genres_schema,
              if_exists='replace', index=False)

26

In [52]:
#adding primary key for genres table
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [53]:
tmdb00 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
tmdb01 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')

df_tmdb = pd.concat([tmdb00, tmdb01])
df_tmdb = df_tmdb[['imdb_id', 'revenue', 'budget', 'certification']]
df_tmdb.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [55]:
#defining max strength length
max_str_len=df_tmdb['imdb_id'].fillna('').map(len).max()

In [57]:
#creating imdb_
key_len = df_tmdb['imdb_id'].fillna('').map(len).max()
title_len = df_tmdb['imdb_id'].fillna('').map(len).max()

tmdb_schema = {
    "imdb_id": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'revenue':Float(),
    'budget':Float(),
    'certificiation':Text(max_str_len+1)}

In [58]:
df_tmdb.to_sql('tmdb_data', engine, dtype=tmdb_schema,
               if_exists='replace', index=False)

3974

## Queries

In [59]:
q = '''SELECT * FROM title_basics LIMIT 5;'''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

In [60]:
q = '''SELECT * FROM title_ratings LIMIT 5;'''
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1917
1  tt0000002            5.8       260
2  tt0000005            6.2      2541
3  tt0000006            5.1       175
4  tt0000007            5.4       796

In [61]:
q = '''SELECT * FROM title_genres LIMIT 5;'''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [62]:
q = '''SELECT * FROM genres LIMIT 5;'''
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [63]:
q = '''SELECT * FROM tmdb_data LIMIT 5;'''
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0116391         0.0         0.0          None
4  tt0118694  12855000.0    150000.0            PG